input: "data"
input_dim: 1
input_dim: 4
input_dim: 256
input_dim: 256

layer{
	name: "image"
	type: "Slice"
	bottom: "data"
	top: "image"
	top: "center_map"
	slice_param{
		slice_point: 3
		axis: 1
	}
}

layer{
	name: "pool_center_lower"
	type: "Pooling"
	bottom: "center_map"
	top: "pool_center_lower"
	pooling_param {
		pool: AVE
		kernel_size: 9
		stride: 8
	}
}

layer{
	name: "conv1_stage2"
	type: "Convolution"
	bottom: "image"
	top: "conv1_stage2"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 128
		pad: 2
		kernel_size: 5
		stride: 2
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv1_stage2/bn"
	type: "BN"
	bottom: "conv1_stage2"
	top: "conv1_stage2/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "relu1_stage2"
	type: "ReLU"
	bottom: "conv1_stage2/bn"
	top: "conv1_stage2/bn"
}

layer{
	name: "conv1_1_stage2/bc1/conv"
	type: "Convolution"
	bottom: "conv1_stage2/bn"
	top: "conv1_1_stage2/bc1/conv"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 128
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv1_1_stage2/bc1/conv/bn"
	type: "BN"
	bottom: "conv1_1_stage2/bc1/conv"
	top: "conv1_1_stage2/bc1/conv/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv1_1_stage2/bc1/conv/bn/relu"
	type: "ReLU"
	bottom: "conv1_1_stage2/bc1/conv/bn"
	top: "conv1_1_stage2/bc1/conv/bn"
}

layer{
	name: "conv1_1_stage2/composite/conv"
	type: "Convolution"
	bottom: "conv1_1_stage2/bc1/conv/bn"
	top: "conv1_1_stage2/composite/conv"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv1_1_stage2/composite/conv/bn"
	type: "BN"
	bottom: "conv1_1_stage2/composite/conv"
	top: "conv1_1_stage2/composite/conv/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv1_1_stage2/composite/conv/bn/relu"
	type: "ReLU"
	bottom: "conv1_1_stage2/composite/conv/bn"
	top: "conv1_1_stage2/composite/conv/bn"
}

layer{
	name: "conv1_1_stage2/bn"
	type: "Concat"
	bottom: "conv1_stage2/bn"
	bottom: "conv1_1_stage2/composite/conv/bn"
	top: "conv1_1_stage2/bn"
	concat_param{
		axis: 1
	}
}

layer{
	name: "conv1_2_stage2/bc1/conv"
	type: "Convolution"
	bottom: "conv1_1_stage2/bn"
	top: "conv1_2_stage2/bc1/conv"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 128
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv1_2_stage2/bc1/conv/bn"
	type: "BN"
	bottom: "conv1_2_stage2/bc1/conv"
	top: "conv1_2_stage2/bc1/conv/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv1_2_stage2/bc1/conv/bn/relu"
	type: "ReLU"
	bottom: "conv1_2_stage2/bc1/conv/bn"
	top: "conv1_2_stage2/bc1/conv/bn"
}

layer{
	name: "conv1_2_stage2/composite/conv"
	type: "Convolution"
	bottom: "conv1_2_stage2/bc1/conv/bn"
	top: "conv1_2_stage2/composite/conv"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv1_2_stage2/composite/conv/bn"
	type: "BN"
	bottom: "conv1_2_stage2/composite/conv"
	top: "conv1_2_stage2/composite/conv/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv1_2_stage2/composite/conv/bn/relu"
	type: "ReLU"
	bottom: "conv1_2_stage2/composite/conv/bn"
	top: "conv1_2_stage2/composite/conv/bn"
}

layer{
	name: "conv1_2_stage2/bn"
	type: "Concat"
	bottom: "conv1_1_stage2/bn"
	bottom: "conv1_2_stage2/composite/conv/bn"
	top: "conv1_2_stage2/bn"
	concat_param{
		axis: 1
	}
}

layer{
	name: "conv1_3_stage2/bc1/conv"
	type: "Convolution"
	bottom: "conv1_2_stage2/bn"
	top: "conv1_3_stage2/bc1/conv"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 128
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv1_3_stage2/bc1/conv/bn"
	type: "BN"
	bottom: "conv1_3_stage2/bc1/conv"
	top: "conv1_3_stage2/bc1/conv/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv1_3_stage2/bc1/conv/bn/relu"
	type: "ReLU"
	bottom: "conv1_3_stage2/bc1/conv/bn"
	top: "conv1_3_stage2/bc1/conv/bn"
}

layer{
	name: "conv1_3_stage2/composite/conv"
	type: "Convolution"
	bottom: "conv1_3_stage2/bc1/conv/bn"
	top: "conv1_3_stage2/composite/conv"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv1_3_stage2/composite/conv/bn"
	type: "BN"
	bottom: "conv1_3_stage2/composite/conv"
	top: "conv1_3_stage2/composite/conv/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv1_3_stage2/composite/conv/bn/relu"
	type: "ReLU"
	bottom: "conv1_3_stage2/composite/conv/bn"
	top: "conv1_3_stage2/composite/conv/bn"
}

layer{
	name: "conv1_3_stage2/bn"
	type: "Concat"
	bottom: "conv1_2_stage2/bn"
	bottom: "conv1_3_stage2/composite/conv/bn"
	top: "conv1_3_stage2/bn"
	concat_param{
		axis: 1
	}
}

layer{
	name: "conv1_4_stage2"
	type: "Convolution"
	bottom: "conv1_3_stage2/bn"
	top: "conv1_4_stage2"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 128
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "bn1_4_stage2/bn"
	type: "BN"
	bottom: "conv1_4_stage2"
	top: "conv1_4_stage2/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "relu1_4_stage2"
	type: "ReLU"
	bottom: "conv1_4_stage2/bn"
	top: "conv1_4_stage2/bn"
}

layer{
	name: "conv2_stage2"
	type: "Convolution"
	bottom: "conv1_4_stage2/bn"
	top: "conv2_stage2"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 128
		pad: 1
		kernel_size: 3
		stride: 2
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "bn2_stage2/bn"
	type: "BN"
	bottom: "conv2_stage2"
	top: "conv2_stage2/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "relu2_stage2"
	type: "ReLU"
	bottom: "conv2_stage2/bn"
	top: "conv2_stage2/bn"
}

layer{
	name: "conv2_1_stage2/bc1/conv"
	type: "Convolution"
	bottom: "conv2_stage2/bn"
	top: "conv2_1_stage2/bc1/conv"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 128
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv2_1_stage2/bc1/conv/bn"
	type: "BN"
	bottom: "conv2_1_stage2/bc1/conv"
	top: "conv2_1_stage2/bc1/conv/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv2_1_stage2/bc1/conv/bn/relu"
	type: "ReLU"
	bottom: "conv2_1_stage2/bc1/conv/bn"
	top: "conv2_1_stage2/bc1/conv/bn"
}

layer{
	name: "conv2_1_stage2/composite/conv"
	type: "Convolution"
	bottom: "conv2_1_stage2/bc1/conv/bn"
	top: "conv2_1_stage2/composite/conv"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv2_1_stage2/composite/conv/bn"
	type: "BN"
	bottom: "conv2_1_stage2/composite/conv"
	top: "conv2_1_stage2/composite/conv/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv2_1_stage2/composite/conv/bn/relu"
	type: "ReLU"
	bottom: "conv2_1_stage2/composite/conv/bn"
	top: "conv2_1_stage2/composite/conv/bn"
}

layer{
	name: "conv2_1_stage2/bn"
	type: "Concat"
	bottom: "conv2_stage2/bn"
	bottom: "conv2_1_stage2/composite/conv/bn"
	top: "conv2_1_stage2/bn"
	concat_param{
		axis: 1
	}
}

layer{
	name: "conv2_2_stage2/bc1/conv"
	type: "Convolution"
	bottom: "conv2_1_stage2/bn"
	top: "conv2_2_stage2/bc1/conv"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 128
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv2_2_stage2/bc1/conv/bn"
	type: "BN"
	bottom: "conv2_2_stage2/bc1/conv"
	top: "conv2_2_stage2/bc1/conv/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv2_2_stage2/bc1/conv/bn/relu"
	type: "ReLU"
	bottom: "conv2_2_stage2/bc1/conv/bn"
	top: "conv2_2_stage2/bc1/conv/bn"
}

layer{
	name: "conv2_2_stage2/composite/conv"
	type: "Convolution"
	bottom: "conv2_2_stage2/bc1/conv/bn"
	top: "conv2_2_stage2/composite/conv"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv2_2_stage2/composite/conv/bn"
	type: "BN"
	bottom: "conv2_2_stage2/composite/conv"
	top: "conv2_2_stage2/composite/conv/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv2_2_stage2/composite/conv/bn/relu"
	type: "ReLU"
	bottom: "conv2_2_stage2/composite/conv/bn"
	top: "conv2_2_stage2/composite/conv/bn"
}

layer{
	name: "conv2_2_stage2/bn"
	type: "Concat"
	bottom: "conv2_1_stage2/bn"
	bottom: "conv2_2_stage2/composite/conv/bn"
	top: "conv2_2_stage2/bn"
	concat_param{
		axis: 1
	}
}

layer{
	name: "conv2_3_stage2/bc1/conv"
	type: "Convolution"
	bottom: "conv2_2_stage2/bn"
	top: "conv2_3_stage2/bc1/conv"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 128
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv2_3_stage2/bc1/conv/bn"
	type: "BN"
	bottom: "conv2_3_stage2/bc1/conv"
	top: "conv2_3_stage2/bc1/conv/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv2_3_stage2/bc1/conv/bn/relu"
	type: "ReLU"
	bottom: "conv2_3_stage2/bc1/conv/bn"
	top: "conv2_3_stage2/bc1/conv/bn"
}

layer{
	name: "conv2_3_stage2/composite/conv"
	type: "Convolution"
	bottom: "conv2_3_stage2/bc1/conv/bn"
	top: "conv2_3_stage2/composite/conv"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv2_3_stage2/composite/conv/bn"
	type: "BN"
	bottom: "conv2_3_stage2/composite/conv"
	top: "conv2_3_stage2/composite/conv/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv2_3_stage2/composite/conv/bn/relu"
	type: "ReLU"
	bottom: "conv2_3_stage2/composite/conv/bn"
	top: "conv2_3_stage2/composite/conv/bn"
}

layer{
	name: "conv2_3_stage2/bn"
	type: "Concat"
	bottom: "conv2_2_stage2/bn"
	bottom: "conv2_3_stage2/composite/conv/bn"
	top: "conv2_3_stage2/bn"
	concat_param{
		axis: 1
	}
}

layer{
	name: "conv2_4_stage2/bc1/conv"
	type: "Convolution"
	bottom: "conv2_3_stage2/bn"
	top: "conv2_4_stage2/bc1/conv"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 128
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv2_4_stage2/bc1/conv/bn"
	type: "BN"
	bottom: "conv2_4_stage2/bc1/conv"
	top: "conv2_4_stage2/bc1/conv/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv2_4_stage2/bc1/conv/bn/relu"
	type: "ReLU"
	bottom: "conv2_4_stage2/bc1/conv/bn"
	top: "conv2_4_stage2/bc1/conv/bn"
}

layer{
	name: "conv2_4_stage2/composite/conv"
	type: "Convolution"
	bottom: "conv2_4_stage2/bc1/conv/bn"
	top: "conv2_4_stage2/composite/conv"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv2_4_stage2/composite/conv/bn"
	type: "BN"
	bottom: "conv2_4_stage2/composite/conv"
	top: "conv2_4_stage2/composite/conv/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv2_4_stage2/composite/conv/bn/relu"
	type: "ReLU"
	bottom: "conv2_4_stage2/composite/conv/bn"
	top: "conv2_4_stage2/composite/conv/bn"
}

layer{
	name: "conv2_4_stage2/bn"
	type: "Concat"
	bottom: "conv2_3_stage2/bn"
	bottom: "conv2_4_stage2/composite/conv/bn"
	top: "conv2_4_stage2/bn"
	concat_param{
		axis: 1
	}
}

layer{
	name: "conv2_5_stage2"
	type: "Convolution"
	bottom: "conv2_4_stage2/bn"
	top: "conv2_5_stage2"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 128
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv2_5_stage2/bn"
	type: "BN"
	bottom: "conv2_5_stage2"
	top: "conv2_5_stage2/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "relu2_5_stage2"
	type: "ReLU"
	bottom: "conv2_5_stage2/bn"
	top: "conv2_5_stage2/bn"
}

layer{
	name: "conv2_6_stage2"
	type: "Convolution"
	bottom: "conv2_5_stage2/bn"
	top: "conv2_6_stage2"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 128
		pad: 1
		kernel_size: 3
		stride: 2
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv2_6_stage2/bn"
	type: "BN"
	bottom: "conv2_6_stage2"
	top: "conv2_6_stage2/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "relu2_6_stage2"
	type: "ReLU"
	bottom: "conv2_6_stage2/bn"
	top: "conv2_6_stage2/bn"
}

#aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa
layer{
	name: "conv3_1_stage2_res/branch1/conv_1×1_reduce"
	type: "Convolution"
	bottom: "conv2_6_stage2/bn"
	top: "conv3_1_stage2_res/branch1/conv_1×1_reduce"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv3_1_stage2_res/branch1/conv_1×1_reduce/bn"
	type: "BN"
	bottom: "conv3_1_stage2_res/branch1/conv_1×1_reduce"
	top: "conv3_1_stage2_res/branch1/conv_1×1_reduce/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv3_1_stage2_res/branch2/conv_1×1_reduce"
	type: "Convolution"
	bottom: "conv2_6_stage2/bn"
	top: "conv3_1_stage2_res/branch2/conv_1×1_reduce"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv3_1_stage2_res/branch2/conv_1×1_reduce/bn"
	type: "BN"
	bottom: "conv3_1_stage2_res/branch2/conv_1×1_reduce"
	top: "conv3_1_stage2_res/branch2/conv_1×1_reduce/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv3_1_stage2_res/branch2/conv_1×1_reduce/bn/relu"
	type: "ReLU"
	bottom: "conv3_1_stage2_res/branch2/conv_1×1_reduce/bn"
	top: "conv3_1_stage2_res/branch2/conv_1×1_reduce/bn"
}

layer{
	name: "conv3_1_stage2_res/branch2/conv_3×3"
	type: "Convolution"
	bottom: "conv3_1_stage2_res/branch2/conv_1×1_reduce/bn"
	top: "conv3_1_stage2_res/branch2/conv_3×3"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv3_1_stage2_res/branch2/conv_3×3/bn"
	type: "BN"
	bottom: "conv3_1_stage2_res/branch2/conv_3×3"
	top: "conv3_1_stage2_res/branch2/conv_3×3/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv3_1_stage2_res/branch3/conv_1×1_reduce"
	type: "Convolution"
	bottom: "conv2_6_stage2/bn"
	top: "conv3_1_stage2_res/branch3/conv_1×1_reduce"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv3_1_stage2_res/branch3/conv_1×1_reduce/bn"
	type: "BN"
	bottom: "conv3_1_stage2_res/branch3/conv_1×1_reduce"
	top: "conv3_1_stage2_res/branch3/conv_1×1_reduce/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv3_1_stage2_res/branch3/conv_1×1_reduce/bn/relu"
	type: "ReLU"
	bottom: "conv3_1_stage2_res/branch3/conv_1×1_reduce/bn"
	top: "conv3_1_stage2_res/branch3/conv_1×1_reduce/bn"
}

layer{
	name: "conv3_1_stage2_res/branch3/conv_3×3"
	type: "Convolution"
	bottom: "conv3_1_stage2_res/branch3/conv_1×1_reduce/bn"
	top: "conv3_1_stage2_res/branch3/conv_3×3"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv3_1_stage2_res/branch3/conv_3×3/bn"
	type: "BN"
	bottom: "conv3_1_stage2_res/branch3/conv_3×3"
	top: "conv3_1_stage2_res/branch3/conv_3×3/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv3_1_stage2_res/branch3/conv_3×3/bn/relu"
	type: "ReLU"
	bottom: "conv3_1_stage2_res/branch3/conv_3×3/bn"
	top: "conv3_1_stage2_res/branch3/conv_3×3/bn"
}

layer{
	name: "conv3_1_stage2_res/branch3/conv2_3×3"
	type: "Convolution"
	bottom: "conv3_1_stage2_res/branch3/conv_3×3/bn"
	top: "conv3_1_stage2_res/branch3/conv2_3×3"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv3_1_stage2_res/branch3/conv2_3×3/bn"
	type: "BN"
	bottom: "conv3_1_stage2_res/branch3/conv2_3×3"
	top: "conv3_1_stage2_res/branch3/conv2_3×3/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv3_1_stage2_res/branch5/concat"
	type: "Concat"
	bottom: "conv3_1_stage2_res/branch1/conv_1×1_reduce/bn"
	bottom: "conv3_1_stage2_res/branch2/conv_3×3/bn"
	bottom: "conv3_1_stage2_res/branch3/conv2_3×3/bn"
	top: "conv3_1_stage2_res/branch5/concat"
	concat_param{
		axis: 1
	}
}

layer{
	name: "conv3_1_stage2_res/branch5/concat/relu"
	type: "ReLU"
	bottom: "conv3_1_stage2_res/branch5/concat"
	top: "conv3_1_stage2_res/branch5/concat"
}

layer{
	name: "conv3_1_stage2_res/branch5/conv_1×1_increase"
	type: "Convolution"
	bottom: "conv3_1_stage2_res/branch5/concat"
	top: "conv3_1_stage2_res/branch5/conv_1×1_increase"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 128
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv3_1_stage2_res/branch5/conv_1×1_increase/bn"
	type: "BN"
	bottom: "conv3_1_stage2_res/branch5/conv_1×1_increase"
	top: "conv3_1_stage2_res/branch5/conv_1×1_increase/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv3_1_stage2_res"
	type: "Eltwise"
	bottom: "conv3_1_stage2_res/branch5/conv_1×1_increase/bn"
	bottom: "conv2_6_stage2/bn"
	top: "conv3_1_stage2_res"
	eltwise_param {
		operation: SUM
	}
}

#ooooooooooooooooooooooooooooooooooooooooooooooooooooooooo
layer{
	name: "conv3_1_stage2_res/relu"
	type: "ReLU"
	bottom: "conv3_1_stage2_res"
	top: "conv3_1_stage2_res"
}

#aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa
layer{
	name: "conv3_2_stage2_res/branch1/conv_1×1_reduce"
	type: "Convolution"
	bottom: "conv3_1_stage2_res"
	top: "conv3_2_stage2_res/branch1/conv_1×1_reduce"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv3_2_stage2_res/branch1/conv_1×1_reduce/bn"
	type: "BN"
	bottom: "conv3_2_stage2_res/branch1/conv_1×1_reduce"
	top: "conv3_2_stage2_res/branch1/conv_1×1_reduce/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv3_2_stage2_res/branch2/conv_1×1_reduce"
	type: "Convolution"
	bottom: "conv3_1_stage2_res"
	top: "conv3_2_stage2_res/branch2/conv_1×1_reduce"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv3_2_stage2_res/branch2/conv_1×1_reduce/bn"
	type: "BN"
	bottom: "conv3_2_stage2_res/branch2/conv_1×1_reduce"
	top: "conv3_2_stage2_res/branch2/conv_1×1_reduce/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv3_2_stage2_res/branch2/conv_1×1_reduce/bn/relu"
	type: "ReLU"
	bottom: "conv3_2_stage2_res/branch2/conv_1×1_reduce/bn"
	top: "conv3_2_stage2_res/branch2/conv_1×1_reduce/bn"
}

layer{
	name: "conv3_2_stage2_res/branch2/conv_3×3"
	type: "Convolution"
	bottom: "conv3_2_stage2_res/branch2/conv_1×1_reduce/bn"
	top: "conv3_2_stage2_res/branch2/conv_3×3"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv3_2_stage2_res/branch2/conv_3×3/bn"
	type: "BN"
	bottom: "conv3_2_stage2_res/branch2/conv_3×3"
	top: "conv3_2_stage2_res/branch2/conv_3×3/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv3_2_stage2_res/branch3/conv_1×1_reduce"
	type: "Convolution"
	bottom: "conv3_1_stage2_res"
	top: "conv3_2_stage2_res/branch3/conv_1×1_reduce"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv3_2_stage2_res/branch3/conv_1×1_reduce/bn"
	type: "BN"
	bottom: "conv3_2_stage2_res/branch3/conv_1×1_reduce"
	top: "conv3_2_stage2_res/branch3/conv_1×1_reduce/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv3_2_stage2_res/branch3/conv_1×1_reduce/bn/relu"
	type: "ReLU"
	bottom: "conv3_2_stage2_res/branch3/conv_1×1_reduce/bn"
	top: "conv3_2_stage2_res/branch3/conv_1×1_reduce/bn"
}

layer{
	name: "conv3_2_stage2_res/branch3/conv_3×3"
	type: "Convolution"
	bottom: "conv3_2_stage2_res/branch3/conv_1×1_reduce/bn"
	top: "conv3_2_stage2_res/branch3/conv_3×3"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv3_2_stage2_res/branch3/conv_3×3/bn"
	type: "BN"
	bottom: "conv3_2_stage2_res/branch3/conv_3×3"
	top: "conv3_2_stage2_res/branch3/conv_3×3/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv3_2_stage2_res/branch3/conv_3×3/bn/relu"
	type: "ReLU"
	bottom: "conv3_2_stage2_res/branch3/conv_3×3/bn"
	top: "conv3_2_stage2_res/branch3/conv_3×3/bn"
}

layer{
	name: "conv3_2_stage2_res/branch3/conv2_3×3"
	type: "Convolution"
	bottom: "conv3_2_stage2_res/branch3/conv_3×3/bn"
	top: "conv3_2_stage2_res/branch3/conv2_3×3"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv3_2_stage2_res/branch3/conv2_3×3/bn"
	type: "BN"
	bottom: "conv3_2_stage2_res/branch3/conv2_3×3"
	top: "conv3_2_stage2_res/branch3/conv2_3×3/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv3_2_stage2_res/branch5/concat"
	type: "Concat"
	bottom: "conv3_2_stage2_res/branch1/conv_1×1_reduce/bn"
	bottom: "conv3_2_stage2_res/branch2/conv_3×3/bn"
	bottom: "conv3_2_stage2_res/branch3/conv2_3×3/bn"
	top: "conv3_2_stage2_res/branch5/concat"
	concat_param{
		axis: 1
	}
}

layer{
	name: "conv3_2_stage2_res/branch5/concat/relu"
	type: "ReLU"
	bottom: "conv3_2_stage2_res/branch5/concat"
	top: "conv3_2_stage2_res/branch5/concat"
}

layer{
	name: "conv3_2_stage2_res/branch5/conv_1×1_increase"
	type: "Convolution"
	bottom: "conv3_2_stage2_res/branch5/concat"
	top: "conv3_2_stage2_res/branch5/conv_1×1_increase"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 128
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv3_2_stage2_res/branch5/conv_1×1_increase/bn"
	type: "BN"
	bottom: "conv3_2_stage2_res/branch5/conv_1×1_increase"
	top: "conv3_2_stage2_res/branch5/conv_1×1_increase/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv3_2_stage2_res"
	type: "Eltwise"
	bottom: "conv3_2_stage2_res/branch5/conv_1×1_increase/bn"
	bottom: "conv3_1_stage2_res"
	top: "conv3_2_stage2_res"
	eltwise_param {
		operation: SUM
	}
}

#ooooooooooooooooooooooooooooooooooooooooooooooooooooooooo
layer{
	name: "conv3_2_stage2_res/relu"
	type: "ReLU"
	bottom: "conv3_2_stage2_res"
	top: "conv3_2_stage2_res"
}

#aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa
layer{
	name: "conv4_stage2_res/branch1/conv_1×1_reduce"
	type: "Convolution"
	bottom: "conv3_2_stage2_res"
	top: "conv4_stage2_res/branch1/conv_1×1_reduce"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv4_stage2_res/branch1/conv_1×1_reduce/bn"
	type: "BN"
	bottom: "conv4_stage2_res/branch1/conv_1×1_reduce"
	top: "conv4_stage2_res/branch1/conv_1×1_reduce/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv4_stage2_res/branch2/conv_1×1_reduce"
	type: "Convolution"
	bottom: "conv3_2_stage2_res"
	top: "conv4_stage2_res/branch2/conv_1×1_reduce"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv4_stage2_res/branch2/conv_1×1_reduce/bn"
	type: "BN"
	bottom: "conv4_stage2_res/branch2/conv_1×1_reduce"
	top: "conv4_stage2_res/branch2/conv_1×1_reduce/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv4_stage2_res/branch2/conv_1×1_reduce/bn/relu"
	type: "ReLU"
	bottom: "conv4_stage2_res/branch2/conv_1×1_reduce/bn"
	top: "conv4_stage2_res/branch2/conv_1×1_reduce/bn"
}

layer{
	name: "conv4_stage2_res/branch2/conv_3×3"
	type: "Convolution"
	bottom: "conv4_stage2_res/branch2/conv_1×1_reduce/bn"
	top: "conv4_stage2_res/branch2/conv_3×3"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv4_stage2_res/branch2/conv_3×3/bn"
	type: "BN"
	bottom: "conv4_stage2_res/branch2/conv_3×3"
	top: "conv4_stage2_res/branch2/conv_3×3/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv4_stage2_res/branch3/conv_1×1_reduce"
	type: "Convolution"
	bottom: "conv3_2_stage2_res"
	top: "conv4_stage2_res/branch3/conv_1×1_reduce"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv4_stage2_res/branch3/conv_1×1_reduce/bn"
	type: "BN"
	bottom: "conv4_stage2_res/branch3/conv_1×1_reduce"
	top: "conv4_stage2_res/branch3/conv_1×1_reduce/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv4_stage2_res/branch3/conv_1×1_reduce/bn/relu"
	type: "ReLU"
	bottom: "conv4_stage2_res/branch3/conv_1×1_reduce/bn"
	top: "conv4_stage2_res/branch3/conv_1×1_reduce/bn"
}

layer{
	name: "conv4_stage2_res/branch3/conv_3×3"
	type: "Convolution"
	bottom: "conv4_stage2_res/branch3/conv_1×1_reduce/bn"
	top: "conv4_stage2_res/branch3/conv_3×3"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv4_stage2_res/branch3/conv_3×3/bn"
	type: "BN"
	bottom: "conv4_stage2_res/branch3/conv_3×3"
	top: "conv4_stage2_res/branch3/conv_3×3/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv4_stage2_res/branch3/conv_3×3/bn/relu"
	type: "ReLU"
	bottom: "conv4_stage2_res/branch3/conv_3×3/bn"
	top: "conv4_stage2_res/branch3/conv_3×3/bn"
}

layer{
	name: "conv4_stage2_res/branch3/conv2_3×3"
	type: "Convolution"
	bottom: "conv4_stage2_res/branch3/conv_3×3/bn"
	top: "conv4_stage2_res/branch3/conv2_3×3"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv4_stage2_res/branch3/conv2_3×3/bn"
	type: "BN"
	bottom: "conv4_stage2_res/branch3/conv2_3×3"
	top: "conv4_stage2_res/branch3/conv2_3×3/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv4_stage2_res/branch5/concat"
	type: "Concat"
	bottom: "conv4_stage2_res/branch1/conv_1×1_reduce/bn"
	bottom: "conv4_stage2_res/branch2/conv_3×3/bn"
	bottom: "conv4_stage2_res/branch3/conv2_3×3/bn"
	top: "conv4_stage2_res/branch5/concat"
	concat_param{
		axis: 1
	}
}

layer{
	name: "conv4_stage2_res/branch5/concat/relu"
	type: "ReLU"
	bottom: "conv4_stage2_res/branch5/concat"
	top: "conv4_stage2_res/branch5/concat"
}

layer{
	name: "conv4_stage2_res/branch5/conv_1×1_increase"
	type: "Convolution"
	bottom: "conv4_stage2_res/branch5/concat"
	top: "conv4_stage2_res/branch5/conv_1×1_increase"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 128
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv4_stage2_res/branch5/conv_1×1_increase/bn"
	type: "BN"
	bottom: "conv4_stage2_res/branch5/conv_1×1_increase"
	top: "conv4_stage2_res/branch5/conv_1×1_increase/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv4_stage2_res"
	type: "Eltwise"
	bottom: "conv4_stage2_res/branch5/conv_1×1_increase/bn"
	bottom: "conv3_2_stage2_res"
	top: "conv4_stage2_res"
	eltwise_param {
		operation: SUM
	}
}

#ooooooooooooooooooooooooooooooooooooooooooooooooooooooooo
layer{
	name: "conv4_stage2_res/relu"
	type: "ReLU"
	bottom: "conv4_stage2_res"
	top: "conv4_stage2_res"
}

#aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa
layer{
	name: "conv4_1_stage2_res/branch1/conv_1×1_reduce"
	type: "Convolution"
	bottom: "conv4_stage2_res"
	top: "conv4_1_stage2_res/branch1/conv_1×1_reduce"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv4_1_stage2_res/branch1/conv_1×1_reduce/bn"
	type: "BN"
	bottom: "conv4_1_stage2_res/branch1/conv_1×1_reduce"
	top: "conv4_1_stage2_res/branch1/conv_1×1_reduce/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv4_1_stage2_res/branch2/conv_1×1_reduce"
	type: "Convolution"
	bottom: "conv4_stage2_res"
	top: "conv4_1_stage2_res/branch2/conv_1×1_reduce"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv4_1_stage2_res/branch2/conv_1×1_reduce/bn"
	type: "BN"
	bottom: "conv4_1_stage2_res/branch2/conv_1×1_reduce"
	top: "conv4_1_stage2_res/branch2/conv_1×1_reduce/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv4_1_stage2_res/branch2/conv_1×1_reduce/bn/relu"
	type: "ReLU"
	bottom: "conv4_1_stage2_res/branch2/conv_1×1_reduce/bn"
	top: "conv4_1_stage2_res/branch2/conv_1×1_reduce/bn"
}

layer{
	name: "conv4_1_stage2_res/branch2/conv_3×3"
	type: "Convolution"
	bottom: "conv4_1_stage2_res/branch2/conv_1×1_reduce/bn"
	top: "conv4_1_stage2_res/branch2/conv_3×3"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv4_1_stage2_res/branch2/conv_3×3/bn"
	type: "BN"
	bottom: "conv4_1_stage2_res/branch2/conv_3×3"
	top: "conv4_1_stage2_res/branch2/conv_3×3/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv4_1_stage2_res/branch3/conv_1×1_reduce"
	type: "Convolution"
	bottom: "conv4_stage2_res"
	top: "conv4_1_stage2_res/branch3/conv_1×1_reduce"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv4_1_stage2_res/branch3/conv_1×1_reduce/bn"
	type: "BN"
	bottom: "conv4_1_stage2_res/branch3/conv_1×1_reduce"
	top: "conv4_1_stage2_res/branch3/conv_1×1_reduce/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv4_1_stage2_res/branch3/conv_1×1_reduce/bn/relu"
	type: "ReLU"
	bottom: "conv4_1_stage2_res/branch3/conv_1×1_reduce/bn"
	top: "conv4_1_stage2_res/branch3/conv_1×1_reduce/bn"
}

layer{
	name: "conv4_1_stage2_res/branch3/conv_3×3"
	type: "Convolution"
	bottom: "conv4_1_stage2_res/branch3/conv_1×1_reduce/bn"
	top: "conv4_1_stage2_res/branch3/conv_3×3"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv4_1_stage2_res/branch3/conv_3×3/bn"
	type: "BN"
	bottom: "conv4_1_stage2_res/branch3/conv_3×3"
	top: "conv4_1_stage2_res/branch3/conv_3×3/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv4_1_stage2_res/branch3/conv_3×3/bn/relu"
	type: "ReLU"
	bottom: "conv4_1_stage2_res/branch3/conv_3×3/bn"
	top: "conv4_1_stage2_res/branch3/conv_3×3/bn"
}

layer{
	name: "conv4_1_stage2_res/branch3/conv2_3×3"
	type: "Convolution"
	bottom: "conv4_1_stage2_res/branch3/conv_3×3/bn"
	top: "conv4_1_stage2_res/branch3/conv2_3×3"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv4_1_stage2_res/branch3/conv2_3×3/bn"
	type: "BN"
	bottom: "conv4_1_stage2_res/branch3/conv2_3×3"
	top: "conv4_1_stage2_res/branch3/conv2_3×3/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv4_1_stage2_res/branch5/concat"
	type: "Concat"
	bottom: "conv4_1_stage2_res/branch1/conv_1×1_reduce/bn"
	bottom: "conv4_1_stage2_res/branch2/conv_3×3/bn"
	bottom: "conv4_1_stage2_res/branch3/conv2_3×3/bn"
	top: "conv4_1_stage2_res/branch5/concat"
	concat_param{
		axis: 1
	}
}

layer{
	name: "conv4_1_stage2_res/branch5/concat/relu"
	type: "ReLU"
	bottom: "conv4_1_stage2_res/branch5/concat"
	top: "conv4_1_stage2_res/branch5/concat"
}

layer{
	name: "conv4_1_stage2_res/branch5/conv_1×1_increase"
	type: "Convolution"
	bottom: "conv4_1_stage2_res/branch5/concat"
	top: "conv4_1_stage2_res/branch5/conv_1×1_increase"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 128
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv4_1_stage2_res/branch5/conv_1×1_increase/bn"
	type: "BN"
	bottom: "conv4_1_stage2_res/branch5/conv_1×1_increase"
	top: "conv4_1_stage2_res/branch5/conv_1×1_increase/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv4_1_stage2_res"
	type: "Eltwise"
	bottom: "conv4_1_stage2_res/branch5/conv_1×1_increase/bn"
	bottom: "conv4_stage2_res"
	top: "conv4_1_stage2_res"
	eltwise_param {
		operation: SUM
	}
}

#ooooooooooooooooooooooooooooooooooooooooooooooooooooooooo
layer{
	name: "conv4_1_stage2_res/relu"
	type: "ReLU"
	bottom: "conv4_1_stage2_res"
	top: "conv4_1_stage2_res"
}

#aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa
layer{
	name: "conv4_2_stage2_res/branch1/conv_1×1_reduce"
	type: "Convolution"
	bottom: "conv4_1_stage2_res"
	top: "conv4_2_stage2_res/branch1/conv_1×1_reduce"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv4_2_stage2_res/branch1/conv_1×1_reduce/bn"
	type: "BN"
	bottom: "conv4_2_stage2_res/branch1/conv_1×1_reduce"
	top: "conv4_2_stage2_res/branch1/conv_1×1_reduce/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv4_2_stage2_res/branch2/conv_1×1_reduce"
	type: "Convolution"
	bottom: "conv4_1_stage2_res"
	top: "conv4_2_stage2_res/branch2/conv_1×1_reduce"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv4_2_stage2_res/branch2/conv_1×1_reduce/bn"
	type: "BN"
	bottom: "conv4_2_stage2_res/branch2/conv_1×1_reduce"
	top: "conv4_2_stage2_res/branch2/conv_1×1_reduce/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv4_2_stage2_res/branch2/conv_1×1_reduce/bn/relu"
	type: "ReLU"
	bottom: "conv4_2_stage2_res/branch2/conv_1×1_reduce/bn"
	top: "conv4_2_stage2_res/branch2/conv_1×1_reduce/bn"
}

layer{
	name: "conv4_2_stage2_res/branch2/conv_3×3"
	type: "Convolution"
	bottom: "conv4_2_stage2_res/branch2/conv_1×1_reduce/bn"
	top: "conv4_2_stage2_res/branch2/conv_3×3"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv4_2_stage2_res/branch2/conv_3×3/bn"
	type: "BN"
	bottom: "conv4_2_stage2_res/branch2/conv_3×3"
	top: "conv4_2_stage2_res/branch2/conv_3×3/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv4_2_stage2_res/branch3/conv_1×1_reduce"
	type: "Convolution"
	bottom: "conv4_1_stage2_res"
	top: "conv4_2_stage2_res/branch3/conv_1×1_reduce"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv4_2_stage2_res/branch3/conv_1×1_reduce/bn"
	type: "BN"
	bottom: "conv4_2_stage2_res/branch3/conv_1×1_reduce"
	top: "conv4_2_stage2_res/branch3/conv_1×1_reduce/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv4_2_stage2_res/branch3/conv_1×1_reduce/bn/relu"
	type: "ReLU"
	bottom: "conv4_2_stage2_res/branch3/conv_1×1_reduce/bn"
	top: "conv4_2_stage2_res/branch3/conv_1×1_reduce/bn"
}

layer{
	name: "conv4_2_stage2_res/branch3/conv_3×3"
	type: "Convolution"
	bottom: "conv4_2_stage2_res/branch3/conv_1×1_reduce/bn"
	top: "conv4_2_stage2_res/branch3/conv_3×3"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv4_2_stage2_res/branch3/conv_3×3/bn"
	type: "BN"
	bottom: "conv4_2_stage2_res/branch3/conv_3×3"
	top: "conv4_2_stage2_res/branch3/conv_3×3/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv4_2_stage2_res/branch3/conv_3×3/bn/relu"
	type: "ReLU"
	bottom: "conv4_2_stage2_res/branch3/conv_3×3/bn"
	top: "conv4_2_stage2_res/branch3/conv_3×3/bn"
}

layer{
	name: "conv4_2_stage2_res/branch3/conv2_3×3"
	type: "Convolution"
	bottom: "conv4_2_stage2_res/branch3/conv_3×3/bn"
	top: "conv4_2_stage2_res/branch3/conv2_3×3"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv4_2_stage2_res/branch3/conv2_3×3/bn"
	type: "BN"
	bottom: "conv4_2_stage2_res/branch3/conv2_3×3"
	top: "conv4_2_stage2_res/branch3/conv2_3×3/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv4_2_stage2_res/branch5/concat"
	type: "Concat"
	bottom: "conv4_2_stage2_res/branch1/conv_1×1_reduce/bn"
	bottom: "conv4_2_stage2_res/branch2/conv_3×3/bn"
	bottom: "conv4_2_stage2_res/branch3/conv2_3×3/bn"
	top: "conv4_2_stage2_res/branch5/concat"
	concat_param{
		axis: 1
	}
}

layer{
	name: "conv4_2_stage2_res/branch5/concat/relu"
	type: "ReLU"
	bottom: "conv4_2_stage2_res/branch5/concat"
	top: "conv4_2_stage2_res/branch5/concat"
}

layer{
	name: "conv4_2_stage2_res/branch5/conv_1×1_increase"
	type: "Convolution"
	bottom: "conv4_2_stage2_res/branch5/concat"
	top: "conv4_2_stage2_res/branch5/conv_1×1_increase"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 32
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv4_2_stage2_res/branch5/conv_1×1_increase/bn"
	type: "BN"
	bottom: "conv4_2_stage2_res/branch5/conv_1×1_increase"
	top: "conv4_2_stage2_res/branch5/conv_1×1_increase/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv4_2_stage2_res/branch6/conv_1×1_increase"
	type: "Convolution"
	bottom: "conv4_1_stage2_res"
	top: "conv4_2_stage2_res/branch6/conv_1×1_increase"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 32
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "conv4_2_stage2_res/branch6/conv_1×1_increase/bn"
	type: "BN"
	bottom: "conv4_2_stage2_res/branch6/conv_1×1_increase"
	top: "conv4_2_stage2_res/branch6/conv_1×1_increase/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "conv4_2_stage2_res"
	type: "Eltwise"
	bottom: "conv4_2_stage2_res/branch5/conv_1×1_increase/bn"
	bottom: "conv4_2_stage2_res/branch6/conv_1×1_increase/bn"
	top: "conv4_2_stage2_res"
	eltwise_param {
		operation: SUM
	}
}

#ooooooooooooooooooooooooooooooooooooooooooooooooooooooooo
layer{
	name: "conv4_2_stage2_res/relu"
	type: "ReLU"
	bottom: "conv4_2_stage2_res"
	top: "conv4_2_stage2_res"
}

layer{
	name: "concat_stage2"
	type: "Concat"
	bottom: "conv4_2_stage2_res"
	bottom: "pool_center_lower"
	top: "concat_stage2"
	concat_param{
		axis: 1
	}
}

#aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa
#aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa
layer{
	name: "Mconv1_stage2_res/branchs_1/branch1/conv_1×1_reduce"
	type: "Convolution"
	bottom: "concat_stage2"
	top: "Mconv1_stage2_res/branchs_1/branch1/conv_1×1_reduce"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "Mconv1_stage2_res/branchs_1/branch1/conv_1×1_reduce/bn"
	type: "BN"
	bottom: "Mconv1_stage2_res/branchs_1/branch1/conv_1×1_reduce"
	top: "Mconv1_stage2_res/branchs_1/branch1/conv_1×1_reduce/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "Mconv1_stage2_res/branchs_1/branch2/conv_1×1_reduce"
	type: "Convolution"
	bottom: "concat_stage2"
	top: "Mconv1_stage2_res/branchs_1/branch2/conv_1×1_reduce"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "Mconv1_stage2_res/branchs_1/branch2/conv_1×1_reduce/bn"
	type: "BN"
	bottom: "Mconv1_stage2_res/branchs_1/branch2/conv_1×1_reduce"
	top: "Mconv1_stage2_res/branchs_1/branch2/conv_1×1_reduce/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "Mconv1_stage2_res/branchs_1/branch2/conv_1×1_reduce/bn/relu"
	type: "ReLU"
	bottom: "Mconv1_stage2_res/branchs_1/branch2/conv_1×1_reduce/bn"
	top: "Mconv1_stage2_res/branchs_1/branch2/conv_1×1_reduce/bn"
}

layer{
	name: "Mconv1_stage2_res/branchs_1/branch2/conv_3×3"
	type: "Convolution"
	bottom: "Mconv1_stage2_res/branchs_1/branch2/conv_1×1_reduce/bn"
	top: "Mconv1_stage2_res/branchs_1/branch2/conv_3×3"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "Mconv1_stage2_res/branchs_1/branch2/conv_3×3/bn"
	type: "BN"
	bottom: "Mconv1_stage2_res/branchs_1/branch2/conv_3×3"
	top: "Mconv1_stage2_res/branchs_1/branch2/conv_3×3/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "Mconv1_stage2_res/branchs_1/branch3/conv_1×1_reduce"
	type: "Convolution"
	bottom: "concat_stage2"
	top: "Mconv1_stage2_res/branchs_1/branch3/conv_1×1_reduce"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "Mconv1_stage2_res/branchs_1/branch3/conv_1×1_reduce/bn"
	type: "BN"
	bottom: "Mconv1_stage2_res/branchs_1/branch3/conv_1×1_reduce"
	top: "Mconv1_stage2_res/branchs_1/branch3/conv_1×1_reduce/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "Mconv1_stage2_res/branchs_1/branch3/conv_1×1_reduce/bn/relu"
	type: "ReLU"
	bottom: "Mconv1_stage2_res/branchs_1/branch3/conv_1×1_reduce/bn"
	top: "Mconv1_stage2_res/branchs_1/branch3/conv_1×1_reduce/bn"
}

layer{
	name: "Mconv1_stage2_res/branchs_1/branch3/conv_3×3"
	type: "Convolution"
	bottom: "Mconv1_stage2_res/branchs_1/branch3/conv_1×1_reduce/bn"
	top: "Mconv1_stage2_res/branchs_1/branch3/conv_3×3"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "Mconv1_stage2_res/branchs_1/branch3/conv_3×3/bn"
	type: "BN"
	bottom: "Mconv1_stage2_res/branchs_1/branch3/conv_3×3"
	top: "Mconv1_stage2_res/branchs_1/branch3/conv_3×3/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "Mconv1_stage2_res/branchs_1/branch3/conv_3×3/bn/relu"
	type: "ReLU"
	bottom: "Mconv1_stage2_res/branchs_1/branch3/conv_3×3/bn"
	top: "Mconv1_stage2_res/branchs_1/branch3/conv_3×3/bn"
}

layer{
	name: "Mconv1_stage2_res/branchs_1/branch3/conv2_3×3"
	type: "Convolution"
	bottom: "Mconv1_stage2_res/branchs_1/branch3/conv_3×3/bn"
	top: "Mconv1_stage2_res/branchs_1/branch3/conv2_3×3"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	param{
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "gaussian"
			std: 0.01
		}
		bias_filler {
			type: "constant"
		}
	}
}

layer{
	name: "Mconv1_stage2_res/branchs_1/branch3/conv2_3×3/bn"
	type: "BN"
	bottom: "Mconv1_stage2_res/branchs_1/branch3/conv2_3×3"
	top: "Mconv1_stage2_res/branchs_1/branch3/conv2_3×3/bn"
	bn_param {
		frozen:true
	}
}

layer{
	name: "Mconv1_stage2_res/branchs_1/branch5/concat"
	type: "Concat"
	bottom: "Mconv1_stage2_res/branchs_1/branch1/conv_1×1_reduce/bn"
	bottom: "Mconv1_stage2_res/branchs_1/branch2/conv_3×3/bn"
	bottom: "Mconv1_stage2_res/branchs_1/branch3/conv2_3×3/bn"
	top: "Mconv1_stage2_res/branchs_1/branch5/concat"
	concat_param{
		axis: 1
	}
}

layer{
	name: "Mconv1_stage2_res/branchs_1/branch5/concat/relu"
	type: "ReLU"
	bottom: "Mconv1_stage2_res/branchs_1/branch5/concat"
	top: "Mconv1_stage2_res/branchs_1/branch5/concat"
}

layer{
	name: "Mconv1_stage2_res/branchs_1/branch5/conv_1×1_increase"
	type: "Convolution"
